var data=[
{ province: "北京", city:[{name:"北京", area:["北京","昌平","朝阳","大兴","朝阳区","房山","丰台","怀柔","海淀","密云","门头沟","平谷","顺义","石景山","通州","延庆"]}]},
{ province: "天津", city:[{name:"天津", area:["天津","宝坻","北辰","滨海新区","东丽","静海","津南","蓟县","宁河","武清","西青"]}]},
{ province: "河北", city:[

{name:"石家庄", area:["石家庄","高邑","藁城","井陉","晋州","栾城","灵寿","鹿泉","平山","深泽","无极","行唐","辛集","新乐","元氏","正定","赞皇","赵县"]},

{name:"唐山", area:["曹妃甸","丰南","丰润","滦县","滦南","乐亭","迁西","迁安","唐山","唐海","玉田","遵化"]},

{name:"秦皇岛", area:["北戴河","昌黎","抚宁","卢龙","青皇岛","青龙"]},

{name:"邯郸", area:["成安","磁县","大名","峰峰","肥乡","广平","馆陶","邯郸","鸡泽","临漳","邱县","曲周","涉县","魏县","武安","永年"]},

{name:"邢台", area:["内丘","柏乡","广宗","巨鹿","临城","隆尧","临西","内邱","南和","宁晋","南宫","平乡","清河","任县","沙河","威县","邢台","新河"]},

{name:"保定", area:["博野","蠡县","清苑","安新","安国","保定","定州","定兴","阜平","高阳","高碑店","涞源","涞水","满城","曲阳","容城","顺平","唐县","望都","徐水","雄县","易县","涿州"]},

{name:"张家口", area:["赤城","崇礼","沽源","怀安","怀来","康保","尚义","万全","宣化","蔚县","阳原","张家口","张北","涿鹿"]},

{name:"承德", area:["承德","承德县","丰宁","宽城","滦平","隆化","平泉","围场","兴隆"]},

{name:"沧州", area:["沧县","泊头","沧州","东光","海兴","黄骅","河间","孟村","南皮","青县","任丘","肃宁","吴桥","献县","盐山"]},

{name:"廊坊", area:["霸州","大城","大厂","固安","廊坊","三河","文安","香河","永清"]},

{name:"衡水", area:["安平","阜城","故城","衡水","景县","冀州","饶阳","深州","武邑","武强","枣强"]}

]},
{ province: "山西", city:[

{name:"太原", area:["太原","古交","尖草坪区","小店区","娄烦","清徐","太原古交区","太原南郊","阳曲"]},

{name:"大同", area:["灵丘","大同","大同县","广灵","浑源","灵邱","天镇","阳高","左云"]},

{name:"阳泉", area:["平定","阳泉","盂县"]},

{name:"长治", area:["长治","长子","壶关","黎城","潞城","平顺","沁县","沁源","屯留","武乡","襄垣"]},

{name:"晋城", area:["高平","晋城","陵川","沁水","阳城","泽州"]},

{name:"朔州", area:["怀仁","平鲁","朔州","山阴","右玉","应县"]},

{name:"忻州", area:["保德","定襄","代县","繁峙","河曲","静乐","岢岚","宁武","偏关","神池","五台县","五台山","五寨","忻州","原平"]},

{name:"吕梁", area:["方山","汾阳","交口","交城","吕梁","离石","临县","岚县","石楼","文水","兴县","孝义","中阳"]},

{name:"晋中", area:["和顺","晋中","介休","灵石","平遥","祁县","寿阳","太谷","昔阳","榆次","榆社","左权"]},

{name:"临汾", area:["安泽","大宁","汾西","浮山","古县","洪洞","霍州","侯马","吉县","临汾","蒲县","曲沃","隰县","襄汾","乡宁","永和","翼城"]},

{name:"运城", area:["河津","绛县","临猗","平陆","芮城","稷山","万荣","闻喜","新绛","夏县","运城","垣曲","永济"]}

]},
{ province: "内蒙古", city:[

{name:"呼和浩特", area:["呼和浩特","陈旗","和林格尔","清水河","赛罕","土默特左旗","托克托","武川"]},

{name:"包头", area:["包头","白云鄂博","达尔罕茂明安","固阳","满都拉","土默特右旗","希拉穆仁"]},

{name:"乌海", area:["乌海"]},

{name:"赤峰", area:["阿鲁科尔沁旗","敖汉旗","巴林左旗","巴林右旗","八里罕","宝国吐","赤峰","岗子","浩尔吐","克什克腾旗","喀喇沁旗","喀喇沁","林西","宁城","翁牛特旗"]},

{name:"呼伦贝尔", area:["阿荣旗","陈巴尔虎旗","鄂伦春旗","鄂温克旗","额尔古纳","根河","呼伦贝尔","海拉尔","莫力达瓦旗","满洲里","图里河","小二沟","新巴尔虎左旗","新巴尔虎右旗","牙克石","扎兰屯"]},

{name:"兴安盟", area:["科尔沁右前旗","阿尔山","高力板","胡尔勒","科尔沁右中旗","索伦","突泉","乌兰浩特","兴安盟","扎赉特旗"]},

{name:"通辽", area:["巴雅尔吐胡硕","霍林郭勒","科尔沁左翼中旗","科尔沁左翼后旗","开鲁","库伦旗","奈曼旗","青龙山","舍伯吐","通辽","扎鲁特旗"]},

{name:"锡林郭勒盟", area:["锡林郭勒","阿巴嘎旗","博克图","东乌珠穆沁旗","多伦","二连浩特","苏尼特左旗","苏尼特右旗","太仆寺旗","乌拉盖","西乌珠穆沁旗","镶黄旗","锡林浩特","朱日和","正镶白旗","正蓝旗"]},

{name:"乌兰察布盟", area:["乌兰察布","察哈尔右前旗","察哈尔右中旗","察哈尔右后旗","丰镇","化德","集宁","凉城","商都","四子王旗","兴和","卓资"]},

{name:"伊克昭盟", area:["达拉特旗","东胜","鄂尔多斯","鄂托克前旗","鄂托克旗","河南","杭锦旗","乌审旗","乌审召","伊克乌素","伊金霍洛旗"]},

{name:"巴彦淖尔盟", area:["磴口","大佘太","海力素","杭锦后旗","巴彦淖尔","临河","那仁宝力格","五原","乌拉特前旗","乌拉特中旗","乌拉特后旗","准格尔旗"]},

{name:"阿拉善盟", area:["巴彦诺日公","阿拉善盟","阿拉善右旗","阿拉善左旗","巴彦诺尔贡","额济纳旗","拐子湖","吉兰太","孪井滩","头道湖","乌斯太","锡林高勒","雅布赖","中泉子"]}

]},
{ province: "辽宁", city:[

{name:"沈阳", area:["沈阳","法库","康平","辽中","新民"]},

{name:"大连", area:["长海","大连","金州","旅顺","普兰店","瓦房店","庄河"]},

{name:"鞍山", area:["鞍山","海城","台安","岫岩"]},

{name:"抚顺", area:["抚顺","清原","新宾","章党"]},

{name:"本溪", area:["本溪","本溪县","桓仁"]},

{name:"丹东", area:["丹东","东港","东沟","凤城","宽甸"]},

{name:"锦州", area:["北镇","黑山","锦州","凌海","义县"]},

{name:"营口", area:["大石桥","盖州","营口"]},

{name:"阜新", area:["阜新","彰武"]},

{name:"辽阳", area:["弓长岭","灯塔","辽阳","辽阳县"]},

{name:"盘锦", area:["大洼","盘锦","盘山"]},

{name:"铁岭", area:["昌图","调兵山","开原","铁岭","西丰"]},

{name:"朝阳", area:["北票","朝阳","建平县","喀左","凌源"]},

{name:"葫芦岛", area:["葫芦岛","建昌","绥中","兴城"]}

]},
{ province: "吉林", city:[

{name:"长春", area:["长春","二道","德惠","九台","农安","双阳","榆树"]},

{name:"吉林", area:["桦甸","吉林","蛟河","磐石","舒兰","永吉"]},

{name:"四平", area:["公主岭","梨树","四平","双辽","伊通"]},

{name:"辽源", area:["东丰","东辽","辽源"]},

{name:"通化", area:["辉南","集安","柳河","梅河口","通化","通化县"]},

{name:"白山", area:["抚松","江源","白山","长白","东岗","靖宇","临江"]},

{name:"松原", area:["长岭","扶余","乾安","前郭","松原"]},

{name:"白城", area:["白城","大安","洮南","镇赉","通榆"]},

{name:"延边朝鲜族自治州", area:["安图","敦化","和龙","珲春","龙井","图们","汪清","延吉"]}

]},
{ province: "黑龙江", city:[

{name:"哈尔滨", area:["哈尔滨","阿城","宾县","巴彦","方正","呼兰","木兰","双城","尚志","通河","五常","依兰","延寿"]},

{name:"齐齐哈尔", area:["拜泉","富裕","甘南","克山","克东","龙江","讷河","齐齐哈尔","泰来","依安"]},

{name:"鹤岗", area:["鹤岗","萝北","绥滨"]},

{name:"双鸭山", area:["友谊","宝清","集贤","饶河","双鸭山"]},

{name:"鸡西", area:["虎林","鸡西","鸡东","密山"]},

{name:"大庆", area:["大庆","杜蒙","杜尔伯特","林甸","肇州","肇源"]},

{name:"伊春", area:["嘉荫","铁力","乌伊岭","五营","伊春"]},

{name:"牡丹江", area:["东宁","海林","林口","牡丹江","穆棱","宁安","绥芬河"]},

{name:"佳木斯", area:["抚远","富锦","桦川","桦南","佳木斯","汤原","同江"]},

{name:"七台河", area:["勃利","七台河"]},

{name:"黑河", area:["北安","黑河","嫩江","孙吴","五大连池","逊克"]},

{name:"绥化", area:["安达","海伦","兰西","明水","青冈","庆安","绥化","绥棱","望奎","肇东"]},

{name:"大兴安岭地区", area:["大兴安岭","呼玛","呼中","加格达奇","漠河","塔河","新林"]}

]},
{ province: "上海", city:[

{name:"上海", area:["上海","宝山","崇明","奉贤","嘉定","金山","闵行","南汇","浦东","青浦","松江","徐汇"]}

]},
{ province: "江苏", city:[

{name:"南京", area:["南京","高淳","江宁","江浦","溧水","六合","浦口"]},

{name:"苏州", area:["吴中","常熟","昆山","苏州","太仓","吴江","张家港"]},

{name:"无锡", area:["锡山","江阴","无锡","宜兴"]},

{name:"常州", area:["武进","常州","金坛","溧阳"]},

{name:"镇江", area:["丹徒","丹阳","句容","扬中","镇江"]},

{name:"南通", area:["海安","海门","南通","启东","如皋","如东","通州"]},

{name:"泰州", area:["姜堰","靖江","泰州","泰兴","兴化"]},

{name:"扬州", area:["邗江","宝应","高邮","江都","扬州","仪征"]},

{name:"盐城", area:["盐都","滨海","东台","大丰","阜宁","建湖","射阳","响水","盐城"]},

{name:"连云港", area:["东海","赣榆","灌云","灌南","连云港"]},

{name:"徐州", area:["铜山","丰县","沛县","邳州","睢宁","徐州","新沂"]},

{name:"淮安", area:["淮阴区","淮安区","淮安","洪泽","淮阴县","金湖","涟水","盱眙"]},

{name:"宿迁", area:["宿豫","宿迁","沭阳","泗阳","泗洪"]}

]},
{ province: "浙江", city:[

{name:"杭州", area:["杭州","淳安","富阳","建德","临安","桐庐","萧山","余杭"]},

{name:"宁波", area:["鄞州","镇海","北仑","慈溪","奉化","宁波","宁海","象山","余姚"]},

{name:"温州", area:["苍南","洞头","平阳","瑞安","泰顺","温州","文成","乐清","永嘉"]},

{name:"嘉兴", area:["海宁","海盐","嘉兴","嘉善","平湖","桐乡"]},

{name:"湖州", area:["安吉","长兴","德清","湖州"]},

{name:"绍兴", area:["柯桥","绍兴","上虞","嵊州","新昌","诸暨"]},

{name:"金华", area:["东阳","金华","兰溪","浦江","磐安","武义","义乌","永康"]},

{name:"衢州", area:["衢江","常山","江山","开化","龙游","衢州"]},

{name:"舟山", area:["岱山","定海","普陀","嵊泗","舟山"]},

{name:"台州", area:["黄岩","椒江","路桥","洪家","临海","三门","台州","天台","温岭","仙居","玉环"]},

{name:"丽水", area:["景宁","松阳","缙云","丽水","龙泉","青田","庆元","遂昌","云和"]}

]},
{ province: "安徽", city:[

{name:"合肥", area:["合肥","长丰","巢湖","肥东","肥西","庐江"]},

{name:"芜湖", area:["繁昌","南陵","无为","芜湖","芜湖县"]},

{name:"蚌埠", area:["蚌埠","固镇","怀远","五河"]},

{name:"淮南", area:["潘集","凤台","淮南"]},

{name:"马鞍山", area:["当涂","含山","和县","马鞍山"]},

{name:"淮北", area:["淮北","濉溪"]},

{name:"铜陵", area:["铜陵"]},

{name:"安庆", area:["安庆","怀宁","潜山","宿松","太湖","桐城","望江","岳西","枞阳"]},

{name:"黄山", area:["黄山","黄山区","黄山风景区","祁门","歙县","屯溪","休宁","黟县"]},

{name:"滁州", area:["滁州","定远","凤阳","来安","明光","全椒","天长"]},

{name:"阜阳", area:["阜阳","阜南","界首","临泉","太和","颍上"]},

{name:"宿州", area:["砀山","灵璧","宿州","泗县","萧县"]},

{name:"巢湖", area:["巢湖","含山","无为","庐江","和县"]},

{name:"六安", area:["霍邱","霍山","金寨","六安","寿县","舒城"]},

{name:"亳州", area:["涡阳","亳州","利辛","蒙城"]},

{name:"池州", area:["池州","东至","九华山","青阳","石台"]},

{name:"宣城", area:["广德","泾县","旌德","绩溪","郎溪","宁国","宣城"]}

]},
{ province: "福建", city:[

{name:"福州", area:["福州","长乐","福清","罗源","连江","闽清","闽侯","平潭","永泰"]},

{name:"厦门", area:["同安","厦门"]},

{name:"莆田", area:["城厢","涵江","荔城","秀屿","莆田","仙游","秀屿港"]},

{name:"三明", area:["大田","将乐","建宁","明溪","宁化","清流","三明","沙县","泰宁","尤溪","永安"]},

{name:"泉州", area:["石狮","安溪","崇武","德化","惠安","晋江","南安","泉州","永春"]},

{name:"漳州", area:["长泰","东山","华安","龙海","南靖","平和","云霄","漳州","漳浦","诏安"]},

{name:"南平", area:["光泽","建阳","建瓯","南平","浦城","顺昌","邵武","松溪","武夷山","政和"]},

{name:"龙岩", area:["长汀","龙岩","连城","上杭","武平","永定","漳平"]},

{name:"宁德", area:["福安","福鼎","古田","宁德","屏南","寿宁","霞浦","周宁","柘荣"]}

]},
{ province: "江西", city:[

{name:"南昌", area:["南昌","安义","进贤","南昌县","新建"]},

{name:"景德镇", area:["浮梁","景德镇","乐平"]},

{name:"萍乡", area:["安源","芦溪","上栗","湘东","莲花","萍乡"]},

{name:"九江", area:["德安","都昌","湖口","九江","庐山","彭泽","瑞昌","武宁","星子","修水","永修"]},

{name:"新余", area:["新余","分宜"]},

{name:"鹰潭", area:["鹰潭","贵溪","余江"]},

{name:"赣州", area:["赣县","安远","崇义","大余","定南","赣州","会昌","龙南","南康","宁都","全南","瑞金","上犹","石城","信丰","寻乌","兴国","于都"]},

{name:"吉安", area:["吉安县","安福","吉安","吉水","井冈山","宁冈","遂川","泰和","万安","新干","峡江","永丰","永新"]},

{name:"宜春", area:["奉新","丰城","高安","靖安","上高","铜鼓","万载","宜春","宜丰","樟树"]},

{name:"抚州", area:["崇仁","东乡","抚州","广昌","金溪","乐安","黎川","南城","南丰","宜黄","资溪"]},

{name:"上饶", area:["德兴","广丰","横峰","鄱阳","上饶","上饶县","婺源","万年","余干","弋阳","玉山","铅山"]}

]},
{ province: "山东", city:[

{name:"济南", area:["济南","长清","济阳","平阴","商河","章丘"]},

{name:"青岛", area:["黄岛","即墨","胶州","崂山","莱西","平度","青岛"]},

{name:"淄博", area:["博山","高青","桓台","临淄","沂源","淄博","淄川","周村"]},

{name:"枣庄", area:["台儿庄","滕州","薛城","峄城","枣庄"]},

{name:"东营", area:["东营","河口","垦利","广饶","利津"]},

{name:"烟台", area:["烟台","福山","牟平","招远","龙口","莱阳","莱州","蓬莱","栖霞","海阳","长岛"]},

{name:"潍坊", area:["潍坊","青州","诸城","寿光","安丘","高密","昌邑","昌乐","临朐"]},

{name:"济宁", area:["济宁","嘉祥","曲阜","兖州","邹城","鱼台","金乡","微山","汶上","泗水","梁山"]},

{name:"泰安", area:["泰安","新泰","肥城","宁阳","东平"]},

{name:"威海", area:["威海","乳山","文登","荣成","成山头","石岛"]},

{name:"日照", area:["日照","五莲","莒县"]},

{name:"莱芜", area:["莱芜"]},

{name:"临沂", area:["兰陵","沂南","郯城","沂水","费县","平邑","莒南","蒙阴","临沭","临沂"]},

{name:"德州", area:["乐陵","禹城","陵城","宁津","齐河","武城","庆云","平原","夏津","临邑","德州"]},

{name:"聊城", area:["临清","高唐","阳谷","茌平","莘县","东阿","冠县","聊城"]},

{name:"滨州", area:["邹平","沾化","惠民","博兴","阳信","无棣","滨州"]},

{name:"菏泽", area:["鄄城","单县","郓城","曹县","定陶","巨野","东明","成武","菏泽"]}

]},
{ province: "河南", city:[

{name:"郑州", area:["上街","巩义","新郑","新密","登封","荥阳","中牟","郑州"]},

{name:"开封", area:["开封","尉氏","兰考","杞县","通许"]},

{name:"洛阳", area:["吉利","偃师","孟津","汝阳","伊川","洛宁","嵩县","宜阳","新安","栾川","洛阳"]},

{name:"平顶山", area:["石龙","汝州","舞钢","宝丰","叶县","郏县","鲁山","平顶山"]},

{name:"安阳", area:["林州","安阳","滑县","内黄","汤阴"]},

{name:"鹤壁", area:["浚县","淇县","鹤壁"]},

{name:"新乡", area:["卫辉","辉县","新乡","获嘉","原阳","长垣","封丘","延津"]},

{name:"焦作", area:["沁阳","孟州","修武","温县","武陟","博爱","焦作"]},

{name:"濮阳", area:["濮阳","南乐","台前","清丰","范县"]},

{name:"许昌", area:["禹州","长葛","许昌","鄢陵","襄城"]},

{name:"漯河", area:["临颍","舞阳","漯河"]},

{name:"三门峡", area:["义马","灵宝","渑池","卢氏","陕县","三门峡"]},

{name:"南阳", area:["邓州","桐柏","方城","淅川","镇平","唐河","南召","内乡","新野","社旗","西峡","南阳"]},

{name:"商丘", area:["永城","宁陵","虞城","民权","夏邑","柘城","睢县","商丘"]},

{name:"信阳", area:["潢川","淮滨","息县","新县","商城","固始","罗山","光山","信阳"]},

{name:"周口", area:["项城","商水","淮阳","太康","鹿邑","西华","扶沟","沈丘","郸城","周口"]},

{name:"驻马店", area:["确山","新蔡","上蔡","西平","泌阳","平舆","汝南","遂平","正阳","驻马店"]}

]},
{ province: "湖北", city:[

{name:"武汉", area:["东西湖","蔡甸","江夏","黄陂","新洲","武汉"]},

{name:"黄石", area:["黄石","西塞山","下陆","铁山","大冶","阳新"]},

{name:"十堰", area:["张湾","茅箭","丹江口","竹山","房县","郧西","竹溪","十堰","十堰"]},

{name:"荆州", area:["沙市","荆州","洪湖","石首市","松滋","监利","公安","江陵"]},

{name:"宜昌", area:["宜昌","夷陵","宜都","当阳","枝江","秭归","远安","兴山","五峰","三峡","长阳"]},

{name:"襄阳", area:["襄阳","老河口","枣阳","宜城","南漳","谷城","保康","襄州"]},

{name:"鄂州", area:["鄂城","梁子湖"]},

{name:"荆门", area:["掇刀","钟祥","京山","沙洋","荆门"]},

{name:"孝感", area:["应城","安陆","汉川","云梦","大悟","孝昌","孝感"]},

{name:"黄冈", area:["麻城","武穴","红安","罗田","浠水","蕲春","黄梅","英山","团风","黄冈"]},

{name:"咸宁", area:["咸宁","赤壁","嘉鱼","通山","崇阳","通城"]},

{name:"随州", area:["广水","随州"]},

{name:"恩施土家族苗族自治州", area:["恩施","利川","建始","来凤","巴东","鹤峰","宣恩","咸丰"]},

{name:"仙桃", area:["仙桃"]},

{name:"天门", area:["天门"]},

{name:"潜江", area:["潜江"]},

{name:"神农架林区", area:["神农架林区"]}

]},
{ province: "湖南", city:[

{name:"长沙", area:["湘江新区","浏阳","长沙县","望城","宁乡","长沙"]},

{name:"株洲", area:["醴陵","炎陵","茶陵","攸县","株洲"]},

{name:"湘潭", area:["湘乡","韶山","湘潭"]},

{name:"衡阳", area:["南岳","耒阳","常宁","衡阳","衡东","衡山","衡南","祁东县","衡阳县"]},

{name:"邵阳", area:["武冈","邵东","洞口","新邵","绥宁","新宁","邵阳县","隆回","城步","邵阳"]},

{name:"岳阳", area:["岳阳","临湘","汨罗","湘阴","平江","华容"]},

{name:"常德", area:["津市","澧县","临澧","桃源","汉寿","安乡","石门","常德"]},

{name:"张家界", area:["武陵源","慈利","桑植","张家界"]},

{name:"益阳", area:["赫山区","沅江","桃江","南县","安化","益阳"]},

{name:"郴州", area:["苏仙","资兴","宜章","汝城","安仁","嘉禾","临武","桂东","永兴","桂阳","郴州"]},

{name:"永州", area:["冷水滩","祁阳","蓝山","宁远","新田","东安","江永","道县","双牌","江华","永州"]},

{name:"怀化", area:["洪江","会同","沅陵","辰溪","溆浦","中方","新晃","芷江","通道","靖州","麻阳","怀化"]},

{name:"娄底", area:["冷水江","涟源","新化","双峰","娄底"]},

{name:"湘西土家族苗族自治州", area:["吉首","古丈","龙山","永顺","凤凰","泸溪","保靖","花垣","湘西"]}

]},
{ province: "广东", city:[

{name:"广州", area:["番禺","花都","增城","从化","广州"]},

{name:"深圳", area:["深圳"]},

{name:"东莞", area:["东莞"]},

{name:"中山", area:["中山"]},

{name:"潮州", area:["潮州","潮安","饶平"]},

{name:"揭阳", area:["揭东","揭西","惠来","普宁","揭阳"]},

{name:"云浮", area:["新兴","郁南","云安","罗定","云浮"]},

{name:"珠海", area:["珠海","斗门","金湾"]},

{name:"汕头", area:["潮阳","澄海","南澳","汕头"]},

{name:"韶关", area:["浈江","武江","曲江","乐昌","南雄","始兴","仁化","翁源","新丰","乳源","韶关"]},

{name:"佛山", area:["南海","顺德","三水","高明","佛山"]},

{name:"江门", area:["蓬江","江海","新会","恩平","台山","开平","鹤山","江门"]},

{name:"湛江", area:["赤坎","霞山","坡头","麻章","吴川","廉江","雷州","遂溪","徐闻","湛江"]},

{name:"茂名", area:["茂港","化州","信宜","高州","电白","茂名"]},

{name:"肇庆", area:["高要","四会","广宁","怀集","封开","德庆","肇庆"]},

{name:"惠州", area:["惠阳","博罗","惠东","龙门","惠州"]},

{name:"梅州", area:["兴宁","梅县","大埔","丰顺","五华","平远","蕉岭","梅州"]},

{name:"汕尾", area:["陆丰","海丰","陆河","汕尾"]},

{name:"河源", area:["紫金","龙川","连平","和平","东源","河源"]},

{name:"阳江", area:["阳春","阳西","阳东","阳江"]},

{name:"清远", area:["英德","连州","佛冈","阳山","清新","连山","连南","清远"]}

]},
{ province: "广西", city:[

{name:"南宁", area:["邕宁","武鸣","隆安","马山","上林","宾阳","横县","南宁"]},

{name:"柳州", area:["柳江","柳城","鹿寨","融安","融水","三江","柳州"]},

{name:"桂林", area:["阳朔","临桂","灵川","全州","平乐","兴安","灌阳","荔浦","资源","永福","龙胜","恭城","桂林"]},

{name:"梧州", area:["岑溪","苍梧","藤县","蒙山","梧州"]},

{name:"北海", area:["涠洲岛","合浦","北海"]},

{name:"防城港", area:["防城","东兴","上思","防城港"]},

{name:"钦州", area:["灵山","浦北","钦州"]},

{name:"贵港", area:["桂平","平南","贵港"]},

{name:"玉林", area:["北流","容县","陆川","博白","兴业","玉林"]},

{name:"百色", area:["凌云","平果","西林","乐业","德保","田林","田阳","靖西","田东","那坡","隆林","百色"]},

{name:"贺州", area:["钟山","昭平","富川","贺州"]},

{name:"河池", area:["宜州","天峨","凤山","南丹","东兰","都安","罗城","巴马","环江","大化","河池"]},

{name:"来宾", area:["合山","象州","武宣","忻城","金秀","来宾"]},

{name:"崇左", area:["凭祥","宁明","扶绥","龙州","大新","天等","崇左"]}

]},
{ province: "海南", city:[

{name:"海口", area:["龙华区","秀英区","琼山区","美兰区","其他"]},

{name:"三亚", area:["三亚市","其他"]},

{name:"五指山", area:["五指山"]},

{name:"琼海", area:["琼海"]},

{name:"儋州", area:["儋州"]},

{name:"文昌", area:["文昌"]},

{name:"万宁", area:["万宁"]},

{name:"东方", area:["东方"]},

{name:"澄迈县", area:["澄迈县"]},

{name:"定安县", area:["定安县"]},

{name:"屯昌县", area:["屯昌县"]},

{name:"临高县", area:["临高县"]},

{name:"白沙黎族自治县", area:["白沙黎族自治县"]},

{name:"昌江黎族自治县", area:["昌江黎族自治县"]},

{name:"乐东黎族自治县", area:["乐东黎族自治县"]},

{name:"陵水黎族自治县", area:["陵水黎族自治县"]},

{name:"保亭黎族苗族自治县", area:["保亭黎族苗族自治县"]},

{name:"琼中黎族苗族自治县", area:["琼中黎族苗族自治县"]}

]},
{ province: "重庆", city:[

{name:"重庆", area:["北碚","巴南","璧山","长寿","城口","垫江","大足","涪陵","奉节","丰都","合川","江津","开县","梁平","南川","彭水","黔江","綦江","荣昌","石柱","潼南","铜梁","万盛","万州","巫溪","巫山","武隆","秀山","永川","渝北","云阳","酉阳","忠县"]}

]},
{ province: "四川", city:[

{name:"成都", area:["龙泉驿","青白江","新都","温江","都江堰","彭州","邛崃","崇州","金堂","郫县","新津","双流","蒲江","大邑","成都"]},

{name:"自贡", area:["荣县","富顺","自贡"]},

{name:"攀枝花", area:["仁和","米易","盐边","攀枝花"]},

{name:"泸州", area:["纳溪","泸县","合江","叙永","古蔺","泸州"]},

{name:"德阳", area:["广汉","什邡","绵竹","罗江","中江","德阳"]},

{name:"绵阳", area:["江油","盐亭","三台","平武","安县","梓潼","北川","绵阳"]},

{name:"广元", area:["青川","旺苍","剑阁","苍溪","广元"]},

{name:"遂宁", area:["射洪","蓬溪","遂宁"]},

{name:"内江", area:["东兴","资中","隆昌","威远","内江"]},

{name:"乐山", area:["峨眉山市","夹江","井研","犍为","沐川","马边","峨边","峨眉山","乐山"]},

{name:"南充", area:["阆中","营山","蓬安","仪陇","南部","西充","南充"]},

{name:"眉山", area:["仁寿","彭山","洪雅","丹棱","青神","眉山"]},

{name:"宜宾", area:["宜宾县","兴文","南溪","珙县","长宁","高县","江安","筠连","屏山","宜宾"]},

{name:"广安", area:["广安","华蓥","岳池","邻水","武胜"]},

{name:"达州", area:["通川","万源","渠县","宣汉","开江","大竹","达州","达川"]},

{name:"雅安", area:["芦山","石棉","名山","天全","荥经","宝兴","汉源","雅安"]},

{name:"巴中", area:["南江","平昌","通江","巴中"]},

{name:"资阳", area:["简阳","安岳","乐至","资阳"]},

{name:"阿坝", area:["马尔康","九寨沟","红原","汶川","理县","若尔盖","小金","黑水","金川","松潘","壤塘","茂县","阿坝"]},

{name:"甘孜", area:["康定","丹巴","炉霍","九龙","甘孜","雅江","新龙","道孚","白玉","理塘","德格","乡城","石渠","稻城","色达","巴塘","泸定","得荣"]},

{name:"凉山", area:["西昌","美姑","昭觉","金阳","甘洛","布拖","雷波","普格","宁南","喜德","会东","越西","会理","盐源","德昌","冕宁","木里","凉山"]}

]},
{ province: "贵州", city:[

{name:"贵阳", area:["南明","云岩","花溪","乌当","白云","小河","清镇","开阳","修文","息烽","贵阳"]},

{name:"六盘水", area:["水城","盘县","六枝","六盘水"]},

{name:"遵义", area:["红花岗","汇川","赤水","仁怀","遵义县","绥阳","桐梓","习水","凤冈","正安","余庆","湄潭","道真","务川","遵义"]},

{name:"安顺", area:["普定","平坝","镇宁","紫云","关岭","安顺"]},

{name:"铜仁地区", area:["铜仁","德江","江口","思南","石阡","玉屏","松桃","印江","沿河","万山"]},

{name:"毕节地区", area:["毕节","黔西","大方","织金","金沙","赫章","纳雍","威宁"]},

{name:"黔西南", area:["兴义","望谟","兴仁","普安","册亨","晴隆","贞丰","安龙","黔西南"]},

{name:"黔东南", area:["凯里","施秉","从江","锦屏","镇远","麻江","台江","天柱","黄平","榕江","剑河","三穗","雷山","黎平","岑巩","丹寨","黔东南"]},

{name:"黔南", area:["都匀","福泉","贵定","惠水","罗甸","瓮安","荔波","龙里","平塘","长顺","独山","三都","黔南"]}

]},
{ province: "云南", city:[

{name:"昆明", area:["太华山","东川","安宁","呈贡","晋宁","富民","宜良","嵩明","石林","禄劝","寻甸","昆明"]},

{name:"曲靖", area:["宣威","马龙","沾益","富源","罗平","师宗","陆良","会泽","曲靖"]},

{name:"玉溪", area:["江川","澄江","通海","华宁","易门","峨山","新平","元江","玉溪"]},

{name:"保山", area:["施甸","腾冲","龙陵","昌宁","保山"]},

{name:"昭通", area:["鲁甸","巧家","盐津","大关","永善","绥江","镇雄","彝良","威信","水富","昭通"]},

{name:"丽江", area:["永胜","华坪","宁蒗","丽江"]},

{name:"普洱", area:["普洱","墨江","景东","景谷","镇沅","江城","孟连","澜沧","西盟","宁洱"]},

{name:"临沧", area:["临翔区","凤庆","云县","永德","双江","耿马","沧源","临沧"]},

{name:"德宏", area:["德宏","瑞丽","梁河","盈江","陇川","芒市"]},

{name:"怒江", area:["泸水","福贡","贡山","兰坪","六库","怒江"]},

{name:"迪庆", area:["香格里拉","德钦","维西","迪庆","中甸"]},

{name:"大理", area:["大理","祥云","宾川","弥渡","永平","云龙","洱源","剑川","鹤庆","漾濞","南涧","巍山"]},

{name:"楚雄", area:["楚雄","双柏","牟定","南华","姚安","大姚","永仁","元谋","武定","禄丰"]},

{name:"红河", area:["蒙自","个旧","开远","绿春","建水","石屏","弥勒","泸西","元阳","红河","金平","河口","屏边"]},

{name:"文山", area:["文山","砚山","西畴","麻栗坡","马关","丘北","广南","富宁","邱北"]},

{name:"西双版纳", area:["景洪","勐海","勐腊","西双版纳"]}

]},
{ province: "西藏", city:[

{name:"拉萨", area:["林周","当雄","尼木","曲水","堆龙德庆","达孜","墨竹工卡","拉萨"]},

{name:"那曲", area:["那曲","嘉黎","比如","聂荣","安多","索县","班戈","巴青","尼玛","双湖"]},

{name:"昌都", area:["昌都","江达","贡觉","类乌齐","丁青","察雅","八宿","左贡","芒康","洛隆","边坝"]},

{name:"林芝", area:["林芝","工布江达","米林","墨脱","波密","察隅","朗县"]},

{name:"山南", area:["乃东","扎囊","贡嘎","桑日","琼结","曲松","措美","洛扎","加查","隆子","错那","浪卡子","山南","泽当"]},

{name:"日喀则", area:["日喀则","南木林","江孜","定日","萨迦","拉孜","昂仁","谢通门","白朗","仁布","康马","定结","仲巴","亚东","吉隆","聂拉木","萨嘎","岗巴","帕里"]},

{name:"阿里", area:["噶尔","普兰","札达","日土","革吉","改则","措勤","阿里","申扎","狮泉河"]}

]},
{ province: "陕西", city:[

{name:"西安", area:["临潼","长安","高陵","蓝田","户县","周至","西安"]},

{name:"铜川", area:["耀州","耀县","宜君","铜川"]},

{name:"宝鸡", area:["陈仓","岐山","凤翔","陇县","太白","麟游","扶风","千阳","眉县","凤县","宝鸡"]},

{name:"咸阳", area:["兴平","礼泉","泾阳","永寿","三原","彬县","旬邑","长武","乾县","武功","淳化","咸阳"]},

{name:"渭南", area:["韩城","华阴","蒲城","潼关","白水","澄城","华县","合阳","富平","大荔","渭南"]},

{name:"延安", area:["安塞","洛川","子长","黄陵","延川","富县","延长","甘泉","宜川","志丹","黄龙","吴起","延安","吴旗"]},

{name:"汉中", area:["留坝","镇巴","城固","南郑","洋县","宁强","佛坪","勉县","西乡","略阳","汉中"]},

{name:"榆林", area:["榆阳","清涧","绥德","神木","佳县","府谷","子洲","靖边","横山","米脂","吴堡","定边","榆林"]},

{name:"安康", area:["紫阳","岚皋","旬阳","镇坪","平利","石泉","宁陕","白河","汉阴","安康"]},

{name:"商洛", area:["商州","镇安","山阳","洛南","商南","丹凤","柞水","商洛"]}

]},
{ province: "甘肃", city:[

{name:"兰州", area:["永登","皋兰","榆中","兰州"]},

{name:"嘉峪关", area:["嘉峪关"]},

{name:"金昌", area:["金昌","永昌"]},

{name:"白银", area:["白银","平川","靖远","会宁","景泰"]},

{name:"天水", area:["清水","秦安","甘谷","武山","张家川","天水","麦积"]},

{name:"武威", area:["民勤","古浪","天祝","武威"]},

{name:"酒泉", area:["酒泉","玉门","敦煌","金塔","肃北","玉门镇","安西县","瓜州"]},

{name:"张掖", area:["民乐","临泽","高台","山丹","肃南","张掖"]},

{name:"庆阳", area:["西峰","庆城","环县","华池","合水","正宁","宁县","镇原","庆阳"]},

{name:"平凉", area:["崆峒","泾川","灵台","崇信","华亭","庄浪","静宁","平凉"]},

{name:"定西", area:["安定","通渭","临洮","漳县","岷县","渭源","陇西","定西"]},

{name:"陇南", area:["武都","成县","宕昌","康县","文县","西和","礼县","两当","徽县","陇南"]},

{name:"临夏", area:["临夏","康乐","永靖","广河","和政","东乡","积石山"]},

{name:"甘南", area:["合作","临潭","卓尼","舟曲","迭部","玛曲","碌曲","夏河","甘南"]}

]},
{ province: "青海", city:[

{name:"西宁", area:["湟源","湟中","大通","西宁"]},

{name:"海东地区", area:["平安","乐都","民和","互助","化隆","循化"]},

{name:"海北", area:["祁连","刚察","门源","海北"]},

{name:"海南", area:["共和","同德","贵德","兴海县","贵南"]},

{name:"黄南", area:["尖扎","泽库","河南","黄南"]},

{name:"果洛", area:["玛沁","班玛","甘德","达日","久治","玛多"]},

{name:"玉树", area:["玉树","杂多","称多","治多","囊谦","曲麻莱"]},

{name:"海西", area:["德令哈","格尔木","乌兰","都兰","天峻","海西","冷湖","大柴旦","茫崖"]}

]},
{ province: "宁夏", city:[

{name:"银川", area:["银川","灵武","永宁","贺兰"]},

{name:"石嘴山", area:["陶乐","惠农","平罗","石嘴山"]},

{name:"吴忠", area:["青铜峡","盐池","同心","吴忠"]},

{name:"固原", area:["西吉","隆德","泾源","彭阳","固原"]},

{name:"中卫", area:["中卫","中宁","海原"]}

]},
{ province: "新疆", city:[

{name:"乌鲁木齐", area:["小渠子","乌市牧试站","天池","达坂城","白杨沟","乌鲁木齐","巴仑台"]},

{name:"克拉玛依", area:["克拉玛依","白碱滩","乌尔禾"]},

{name:"吐鲁番", area:["吐鲁番","托克逊","鄯善"]},

{name:"哈密", area:["哈密","伊吾","巴里坤"]},

{name:"和田", area:["和田","洛浦","民丰","皮山","策勒","于田","墨玉"]},

{name:"阿克苏", area:["阿克苏","温宿","沙雅","拜城","阿瓦提","库车","柯坪","新和","乌什"]},

{name:"喀什", area:["喀什","巴楚","泽普","伽师","叶城","岳普湖","疏勒","麦盖提","英吉沙","莎车","疏附","塔什库尔干"]},

{name:"克州", area:["阿图什","阿合奇","乌恰","阿克陶","克州"]},

{name:"巴州", area:["巴州","巴音布鲁克","博湖","和静","和硕","库尔勒","轮台","且末","若羌","铁干里克","塔中","尉犁","焉耆"]},

{name:"昌吉", area:["昌吉","阜康","奇台","玛纳斯","吉木萨尔","呼图壁","木垒","米泉","蔡家湖"]},

{name:"博州", area:["博乐","精河","温泉","阿拉山口","博州"]},

{name:"石河子", area:["石河子","莫索湾","炮台"]},

{name:"阿拉尔", area:["阿拉尔"]},

{name:"阿勒泰", area:["阿勒泰","布尔津","福海","富蕴","哈巴河","吉木乃","青河"]},

{name:"塔城", area:["额敏","和布克赛尔","沙湾","塔城","托里","乌苏","裕民"]},

{name:"伊犁", area:["伊宁","奎屯","伊宁县","特克斯","尼勒克","昭苏","新源","霍城","巩留","察布查尔","霍尔果斯"]}

]},
{ province: "台湾", city:[

{name:"台湾", area:["高雄","台北","桃园","新竹","苗栗","台中","彰化","南投","云林","嘉义","台南","屏东","宜兰","花莲","台东"]}

]},
{ province: "澳门", city:[

{name:"澳门", area:["澳门","氹仔岛","路环岛"]}

]},
{ province: "香港", city:[

{name:"香港", area:["香港","九龙","新界"]}

]},
{ province: "钓鱼岛", city:[

{name:"钓鱼岛", area:["钓鱼岛"]}

]}
]